Revit 2027 API
FamilyManager.Set Method
Set the value of a family parameter of the current family type.
Overload List
Name | Description
Set(FamilyParameter, ElementId) | Set the ElementId value of a family parameter of the current family type.
Set(FamilyParameter, Double) | Set the double value of a family parameter of the current family type.
Set(FamilyParameter, Int32) | Set the integer value of a family parameter of the current family type.
Set(FamilyParameter, String) | Set the string value of a family parameter of the current family type.
Top
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace